ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_tsc.c
  /* All configuration done */
  return IOE_OK;
}

/**
  * @brief  Configures the selected pin to be in Alternate function or not
  * @param  DeviceAddr: The address of the IOExpander, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  IO_Pin: IO_Pin_x, Where x can be from 0 to 7.
  * @param  NewState: State of the AF for the selected pin, could be
  *         ENABLE or DISABLE.
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_IOAFConfig(uint8_t DeviceAddr, uint8_t IO_Pin, FunctionalState NewState)
{
  uint8_t tmp = 0;

  /* Get the current state of the GPIO_AF register */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_REG_GPIO_AF);

  if (NewState != DISABLE) {
    /* Enable the selected pins alternate function */
    tmp |= (uint8_t)IO_Pin;
  } else {
    /* Disable the selected pins alternate function */
    tmp &= ~(uint8_t)IO_Pin;
  }

  /* Write back the new value in GPIO_AF register */
  I2C_WriteDeviceRegister(DeviceAddr, IOE_REG_GPIO_AF, tmp);

  /* If all OK return IOE_OK */
  return IOE_OK;
}

/**
  * @brief  Configures the Edge for which a transition is detectable for the
  *         the selected pin.
  * @param  DeviceAddr: The address of the IOExpander, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  IO_Pin: IO_Pin_x, Where x can be from 0 to 7.
  * @param  Edge: The edge which will be detected. This parameter can be one or a
  *         a combination of following values: EDGE_FALLING and EDGE_RISING .
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_IOEdgeConfig(uint8_t DeviceAddr, uint8_t IO_Pin, uint8_t Edge)
{
  uint8_t tmp1 = 0, tmp2 = 0;

  /* Get the registers values */
  tmp1 = I2C_ReadDeviceRegister(DeviceAddr, IOE_REG_GPIO_FE);
  tmp2 = I2C_ReadDeviceRegister(DeviceAddr, IOE_REG_GPIO_RE);

  /* Disable the Falling Edge */
  tmp1 &= ~(uint8_t)IO_Pin;
  /* Disable the Falling Edge */
  tmp2 &= ~(uint8_t)IO_Pin;

  /* Enable the Falling edge if selected */
  if (Edge & EDGE_FALLING) {
    tmp1 |= (uint8_t)IO_Pin;
  }

  /* Enable the Rising edge if selected */
  if (Edge & EDGE_RISING) {
    tmp2 |= (uint8_t)IO_Pin;
  }

  /* Write back the registers values */
  I2C_WriteDeviceRegister(DeviceAddr, IOE_REG_GPIO_FE, tmp1);
  I2C_WriteDeviceRegister(DeviceAddr, IOE_REG_GPIO_RE, tmp2);

  /* if OK return 0 */
  return IOE_OK;
}

/**
  * @brief  Configures the Interrupt line active state and format (level/edge)
  * @param  Polarity: could be
  *   @arg  Polarity_Low: Interrupt line is active Low/Falling edge
  *   @arg  Polarity_High: Interrupt line is active High/Rising edge
  * @param  Type: Interrupt line activity type, could be one of the following values
  *   @arg  Type_Level: Interrupt line is active in level model
  *   @arg  Type_Edge: Interrupt line is active in edge model
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_ITOutConfig(uint8_t Polarity, uint8_t Type)
{
  uint8_t tmp = 0;

  /*  Get the register IOE_REG_INT_CTRL value */
  tmp = I2C_ReadDeviceRegister(IOE_1_ADDR, IOE_REG_INT_CTRL);

  /* Mask the polarity and type bits */
  tmp &= ~(uint8_t)0x06;

  /* Modify the Interrupt Output line configuration */
  tmp |= (uint8_t)(Polarity | Type);

  /* Set the register */
  I2C_WriteDeviceRegister(IOE_1_ADDR, IOE_REG_INT_CTRL, tmp);

  /* If all OK return IOE_OK */
  return IOE_OK;
}


/**
  * @brief  Writes a value in a register of the device through I2C.
  * @param  DeviceAddr: The address of the IOExpander, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  RegisterAddr: The target register address
  * @param  RegisterValue: The target register value to be written
  * @retval IOE_OK: if all operations are OK. Other value if error.
  */
uint8_t I2C_WriteDeviceRegister(uint8_t DeviceAddr, uint8_t RegisterAddr, uint8_t RegisterValue)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint8_t read_verif = 0;

  status = HAL_I2C_Mem_Write_DMA(&hi2c1_tsc, DeviceAddr, RegisterAddr, I2C_MEMADD_SIZE_8BIT, &RegisterValue, 1);
  HAL_Delay(1);

#ifdef VERIFY_WRITTENDATA
  /* Verify (if needed) that the loaded data is correct  */

  /* Read the just written register*/
  read_verif = I2C_ReadDeviceRegister(DeviceAddr, RegisterAddr);
  /* Load the register and verify its value  */
  if (read_verif != RegisterValue) {
    /* Control data wrongly transfered */
    read_verif = IOE_FAILURE;
  } else {
    /* Control data correctly transfered */
    read_verif = 0;
  }
#endif

  /* Return the verifying value: 0 (Passed) or 1 (Failed) */
  return (read_verif);
}

uint8_t I2C_ReadDeviceRegister(uint8_t DeviceAddr, uint8_t RegisterAddr)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint8_t IOE_BufferRX[2] = {0x00, 0x00};

  status = HAL_I2C_Mem_Read_DMA(&hi2c1_tsc, DeviceAddr, RegisterAddr, I2C_MEMADD_SIZE_8BIT, IOE_BufferRX, 1);
  HAL_Delay(1);
  if (status == HAL_OK)
  {
    return (IOE_BufferRX[0]);
  }
  else
  {
    return (HAL_ERROR);
  }
}


/**
  * @brief  Reads a buffer of 2 bytes from the device registers.
  * @param  DeviceAddr: The address of the device, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval A pointer to the buffer containing the two returned bytes (in halfword).
  */
uint16_t I2C_ReadDataBuffer(uint8_t DeviceAddr, uint8_t RegisterAddr)
{
  uint8_t tmp= 0;
  HAL_StatusTypeDef status = HAL_OK;
  uint8_t IOE_BufferRX[2] = {0x00, 0x00};

  status = HAL_I2C_Mem_Read_DMA(&hi2c1_tsc, DeviceAddr, RegisterAddr, I2C_MEMADD_SIZE_8BIT, IOE_BufferRX, 2);
  HAL_Delay(1);
  if (status == HAL_OK)
  {
    /* Reorganize received data */
    tmp = IOE_BufferRX[0];
    IOE_BufferRX[0] = IOE_BufferRX[1];
    IOE_BufferRX[1] = tmp;

    /* return a pointer to the IOE_Buffer */
    return (*(__IO uint16_t *) IOE_BufferRX);
  }
  else
  {
    return (HAL_ERROR);
  }
}


/**
  * @brief  Return Touch Screen X position value
  * @param  None
  * @retval X position.
  */
uint16_t IOE_TS_Read_X(void)
{
#if 0
  int32_t x, xr;

  x = I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_X);

  /* first correction */
  xr =  (x * 320) >> 12;
  /* second correction */
  xr = ((xr * 32)/29) - 17;

  if (xr <= 0) {
    xr = 0;
  }

  return (uint16_t)(xr);
#else
  int32_t icount, sum = 0;

  for (icount = 0; icount < 16; icount++) {
    sum += I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_X);
  }
  sum >>= 4;

  if (sum <= 0) {
    sum = 0;
  }

  return (uint16_t)(sum);
#endif
}

/**
  * @brief  Return Touch Screen Y position value
  * @param  None
  * @retval Y position.
  */
uint16_t IOE_TS_Read_Y(void)
{
#if 0

  int32_t y, yr;
  y= I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_Y);

  yr= (y * 240) >> 12;
  yr = ((yr * 240) / 217) - 12;

  if (yr <= 0) {
    yr = 0;
  }
  return (uint16_t)(yr);
#else
  int32_t icount, sum = 0;

  for (icount = 0; icount < 16; icount++) {
    sum += I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_Y);
  }
  sum >>= 4;

  if (sum <= 0) {
    sum = 0;
  }

  return (uint16_t)(sum);
#endif
}

/**
  * @brief  Return Touch Screen Z position value
  * @param  None
  * @retval Z position.
  */
static uint16_t IOE_TS_Read_Z(void)
{
  uint32_t z;
  z = I2C_ReadDataBuffer(IOE_1_ADDR, IOE_REG_TSC_DATA_Z);

  if (z <= 0) {
    z = 0;
  }
  return (uint16_t)(z);
}





/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/*******END OF FILE*******/
